#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`failure`

<details><summary>Show Plan</summary>

```terraform


Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform planned the following actions, but then encountered a problem:

  # aws_dynamodb_table.cliente will be created
  + resource "aws_dynamodb_table" "cliente" {
      + arn              = (known after apply)
      + billing_mode     = "PROVISIONED"
      + hash_key         = "cpf"
      + id               = (known after apply)
      + name             = "cliente"
      + read_capacity    = 20
      + stream_arn       = (known after apply)
      + stream_label     = (known after apply)
      + stream_view_type = (known after apply)
      + tags             = {
          + "Environment" = "production"
          + "Name"        = "cliente-tabela"
        }
      + tags_all         = {
          + "Environment" = "production"
          + "Name"        = "cliente-tabela"
        }
      + write_capacity   = 20

      + attribute {
          + name = "cpf"
          + type = "S"
        }

      + point_in_time_recovery (known after apply)

      + server_side_encryption (known after apply)

      + ttl (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

```

</details>

*Pushed by: @CarlaCCP, Action: `pull_request`*